package com.example.sarashpaz.model;

import com.example.sarashpaz.R;

import java.util.ArrayList;

public class FoodsSearch {
    ArrayList<ItemRecycler> arrayFoods;
    public ArrayList setArrayDefult() {
        arrayFoods = new ArrayList<>();
        arrayFoods.add(new ItemRecycler(R.drawable.soupjo,
                "سوپ جو قرمز",
                "جو پرک :3/4 لیوان\n" +
                        "آب مرغ :   7 لیوان\n" +
                        "پیاز :1 عدد متوسط\n" +
                        "هویج :2 عدد متوسط\n" +
                        "آبلیمو:2 قاشق غذا خوری\n" +
                        "رب گوجه :یک و نیم قاشق غذا خوری\n" +
                        "آرد :2 قاشق غذا خوری سر پر\n" +
                        "آب :1 لیوان\n" +
                        "جعفری خشک :1 قاشق غذا خوری سرپر\n" +
                        "ادویه کاری :نصف قاشق چایخوری\n" +
                        "نمک و فلفل سیاه :به مقدار کافی\n",
                "ابتدا اسکلت مرغ و هویج وزعفران و سیر وپیاز ونمک و برگ بو را با حدود دو و نیم لیتر آب می گذاریم تا بپزه و سپس آنرا صاف می کنیم .. آب مرغ را هم می تونیم در فریزر نگهداری کنیم و برای درست کردن سوپ از آن استفاده کنیم ..\n" +
                        "پیاز وهویج را خیلی ریز خرد می کنیم.\n" +
                        "مواد فوق را به همراه آب مرغ و جوپرک را روی حرارت می گذاریم تا به جوش بیاد و سپس حرارت را ملایم می کنیم ودر قابلمه را می گذاریم تا حدود نیم ساعت بپزه.\n" +
                        "سپس آرد را دریک لیوان آب سرد حل می کنیم و به همراه ادویه وجعفری به سوپ اضافه می کنیم و صبر می کنیم تا دوباره به جوش بیاد و بوی خامی ارد بره.\n" +
                        "در آخر آبلیمو ورب گوجه را به سوپ اضافه می کنیم. و صبر می کنیم تا سوپ جا بیفته …\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.soupzorat,
                "سوپ ذرت با شیر",
                "شیر 3 پیمانه\n" +
                        "ذرت منجمد  2 پیمانه\n" +
                        "پیازچه 10 ساقه\n" +
                        "سیب زمینی  1 عدد\n" +
                        "کرفس 1 شاخه\n" +
                        "پیاز متوسط 1 عدد\n" +
                        "آرد گندم  1 قاشق سوپ خوری\n" +
                        "کره  ½ قاشق سوپ خوری\n" +
                        "آویشن خشک  ½ قاشق چای خوری\n" +
                        "جعفری  ¼ پیمانه\n" +
                        "روغن زیتون  به مقدار لازم\n",
                " پوست سیب زمینی ها را گرفته و به شکل مکعب های کوچک خرد می کنیم.\n" +
                        "کره را در یک قابلمه متوسط بر روی شعله متوسط حرارت داده و ساقه های خرد شده کرفس و سیب زمینی را همراه با پیاز و آویشن اضافه کرده و شروع به هم زدن می کنیم تا جایی که سبزیجات شروع به قهوه ای رنگ شدن کنند.\n" +
                        "    آرد را بر روی سیزیجات پاشیده و چند دقیقه دیگر مواد را هم می زنیم.\n" +
                        "    شیر را بر روی مواد ریخته و شعله را بالا می بریم تا موادمان به جوش بیاید و ضمنا دائم سوپ را هم می زنیم تا مواد به ته ظرف نچسبند.\n" +
                        "    شعله را کم کرده سوپ را می پزیم تا سیب زمینی ها نرم و ملایم شوند اما نباید خمیر یا پوره مانند شوند. این امر حدود 10 دقیقه زمان می برد.\n" +
                        "در این بین، برگ های کرفس را خرد می کنیم، همین طور انتهای پیازچه ها را گرفته و به صورت نازک برش می دهیم. همین که سیب زمینی ها نرم شدند، دانه های ذرت، کمی روغن زیتون را همراه با پیازچه و برگ های کرفس اضافه می کنیم.\n" +
                        "    می گذاریم سوپ روی شعله ملایم گاز جا بیفتد و غلظت مد نظر ما را بدست آورد سپس سرو می کنیم.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.soupminestrone,
                "سوپ مینسترون (Minestrone Soup)",
                "روغن زیتون 1 قاشق غذا خوری\n" +
                        "تره فرنگی 3 عدد\n" +
                        "سیر  دوحبه ریز خرد شده\n" +
                        "هویج خرد شده  6 عدد\n" +
                        "ساقه کرفس  4 عدد خرد شده\n" +
                        "سیب زمینی 2 عدد بزرگ\n" +
                        "کدو خیاری 2 عدد\n" +
                        "گوجه فرنگی 4 عدد خرد شده\n" +
                        "کلم بروکلی ½ یک گل متوسط\n" +
                        "پیازچه 3 عدد\n" +
                        "جعفری تازه خرد شده ½پیمانه\n" +
                        "نمک و فلفل سیاه تازه خرد شده   به میزان لازم\n" +
                        "برگ بو   1 عدد\n" +
                        "آب مرغ  1 لیتر\n" +
                        "آب   ½1 پیمانه\n" +
                        "کنسرو لوبیا سفید پخته  35 گرم\n" +
                        "پنیر پارمزان رنده شده  1 پیمانه\n" +
                        "سرکه سفید  ¼ پیمانه\n" +
                        "دانه ذرت  1پیمانه\n",
                "  در یک قابلمه بزرگ، روغن زیتون را روی حرارت متوسط داغ می کنیم.\n" +
                        "    تره فرنگی (ترجیحاً از قسمت های سفید استفاده می\u200Eکنیم که لطیف تر و تازه تر است) را اضافه کرده (به جای تره فرنگی از یک عدد پیاز هم می توانید استفاده کنید) و حدود 4 دقیقه آن را سرخ می کنیم تا زمانی که نرم شود اما قهوه ای نشود.\n" +
                        "    سیر، هویج، کرفس و سیب زمینی ها را پوست کنده و به مکعب های 2 سانتی خرد کرده و اضافه می کنیم و 3 دقیقه دیگر سرخ می کنیم. کدو خیاری را مکعبی خرد می کنیم، کلم بروکلی، پیازچه و نیمی از جعفری را اضافه کرده و خوب هم می زنیم. گوجه فرنگی ها، نمک و فلفل، برگ بو ، آب مرغ (آب مرغ خانگی یا کنسرو شده کم سدیم)، آب و در صورت تمایل سرکه را اضافه می کنیم و شعله را زیاد می کنیم. آن را به نقطه جوش رسانده و سپس حرارت را کم می کنیم، روی حرارت نسبتاً پایین، در آن را نیمه باز قرار داده و می گذاریم 30 تا 45 دقیقه آهسته بجوشد، یا تا زمانی که سیب زمینی ها و سبزیجات نرم شوند.\n" +
                        "    برگ بو را از سوپ جدا می کنیم و طعم آن را می چشیم. اگر طعم ضعیفی دارد، می گذاریم 5 تا 10 دقیقه دیگر با قوت بجوشد و کم کم آن را کم می کنیم. در صورت تمایل ذرت و لوبیای پخته و آب گرفته را اضافه کرده و 2 دقیقه دیگر می گذاریم بجوشد.\n" +
                        "    باقی جعفری را درست قبل از سرو کردن آن روی سوپ می پاشیم و پنیر رنده شده را کنار آن سرو می کنیم.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.soupitaliaee, "سوپ گیاهی ایتالیایی", "مواد لازم سوپ", "طرز تهیه سوپ"));
        arrayFoods.add(new ItemRecycler(R.drawable.soupmeigu, "ﺳﻮپ ﻣﻴﮕﻮ ﺗﻨﺪ", "مواد لازم سوپ", "طرز تهیه سوپ"));
        arrayFoods.add(new ItemRecycler(R.drawable.souptailandi, "سوپ تایلندی تام یام", "مواد لازم سوپ", "طرز تهیه سوپ"));
        arrayFoods.add(new ItemRecycler(R.drawable.hamberger1, "همبرگر",
                " گوشت چرخ کرده :100 گرم\n" +
                        "پنیر پیتزا :به مقدار دلخواه\n" +
                        "زرده تخم مرغ :دو عدد\n" +
                        "پیاز :یک عدد\n" +
                        "نمک :به میزان لازم\n" +
                        "فلفل :به میزان لازم\n" +
                        "پودر گردو :در صورت تمایل\n" +
                        "روغن :به میزان لازمهمبرگر\n",
                "پیاز را سرخ میکنیم و بعد به گوشت اضافه کرده و به خوبی مخلوط میکنیم .\n" +
                        "    زرده را به گوشت اضافه کرده به خوبی ماساژ میدهیم و بعد نیز نمک و فلفل را به آن اضافه میکنیم .\n" +
                        "    روی تخته پودر نان میپاشیم ، گلوله هایی به اندازه نارنگی از مواد را برداشته ، بروی تخته گرد کرده و نازک میکنیم ، سپس در تابه چدنی سرخ میکنیم .\n" +
                        "    بعد از این که همبرگر ها آماده شدند ، بر روی آنها مقداری پنیر پیتزا ریخته و آن را برای مدت زمان چند دقیقه درون فر میگذاریم تا پنیر باز شود .\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.meigusokhari1,
                "میگو سوخاری",
                "میگو: 1 کیلو\n" +
                        "آبلیمو: یک قاشق سوپخوری\n" +
                        "ماست:دو قاشق سوپخوری\n" +
                        "پیاز: یک عدد\n" +
                        "آرد : 2/3 لیوان\n" +
                        "تخم مرغ : یک عدد\n" +
                        "زعفران : نصف قاشق چایخوری\n" +
                        "نمک : به مقدار لازم\n" +
                        "بیکینگ پودر:یک قاشق چایخوری\n" +
                        "فلفل : به مقدار لازم\n",
                "     اول میگو را تمیز میکنیم پوست آن را کنده ، میشوییم و سپس آن را در آب پیاز که قبلا آن را رنده کرده و آب آن را جدا کرده ایم می ریزیم.\n" +
                        "            بعلاوه مقداری آبلیمو و فلفل سیاه. بعد آن را مخلوط می کنیم .\n" +
                        "            در ظرف را بسته و یک ساعت داخل یخچال قرار می دهیم . \n" +
                        "            سس مخصوص میگو پفکی را با مخلوط کردن آرد ، تخم مرغ، زعفران ، ماست ،بیکینگ پودر و نمک تهیه می کنیم. \n" +
                        "            سس ما نباید زیاد سفت یا شل باشد. اگر سفت شد مقداری ماست و اگر شل شد مقداری آرد به آن بیافزایید.\n" +
                        "            سپس میگوها را از آب پیاز خارج کرده و داخل مایع ریخته ، مخلوط کرده و در ظرف را گذاشته و نیم ساعت درون یخچال قرار می دهیم .\n" +
                        "              یک ظرف کوچک نچسب را روی اجاق گاز قرارداده و داخل آن روغن ریخته و می گذاریم داغ شود.\n" +
                        "            ظرف باید کوچک باشد تا روغن روی میگو ها را بگیرد، پس از اینکه روغن کاملاً داغ شد حرارت را پائین کشیده و میگوها را یکی یکی داخل روغن می ریزیم وقتی یک طرف آن طلایی شد ، میگو را بر می گردانیم تا طرف دیگر آن نیز طلایی شود ، دقت کنید حرارت مقداری باشد که روغن نسوزد .\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.pitzza1,
                "پیتزا پپرونی",
                "گوشت چرخ کرده:200گرم\n" +
                        "فلفل دلمه ای:1عدد\n" +
                        "رب گوجه فرنگی :3قاشق غذاخوری\n" +
                        "قارچ :200گرم\n" +
                        "پیاز :1عدد\n" +
                        "کالباس : 200گرم\n" +
                        "پنیرپیتزا :به مقدازلازم\n" +
                        "نمک فلفل پودر اویشن:به مقذار دلخواه\n",
                "  پیاز راخرد کنید ودرون ماهیتابه بامقداری روغن تفت بدهید تانرم شود سپس گوشت نمک فلفل وپودر اویشن رابه ان اضافه کرده وباحرارت ملایم تفت میدهیم!پس از اینکه رنگ گوشت تغییر کرد 1قاشق رب گوجه فرنگی اضافه نموده ودوباره تفت میدهیم وپس از 5دقیقه از روی حرارت اجاق برمیداریم!\n" +
                        "        کالباس رامکعبی خرد کنید پیاز راحلقه ای خرد کنید فلفل دلمه ای را ریز کرده مقداری زیتون هم ریز کنید!\n" +
                        "        خمیر پیتزا را نازک پهن کنید 2قاشق رب گوجه فرنگی راتفت داده تا بوی خامی ندهد سپس با قلمو روی خمیر پیتزا پخش کنید ومقداری پنیر بریزید وتمامی موادی راکه خرد کرده بودید(کالباس پیاز و...)به همراه مایه گوشتی روی خمیر بچینید ودر انتها با لایه کاملی از پنیر پیتزا پوشش دهیدوروی ان زیتون بریزیدو اجازه دهید پیتزای شما 20دقیقه بماند تا خمیر استراحت کند ودر زمان پخت خوب ترد وبرشته شود.\n" +
                        "        پیتزا را به مدت 15الی 20 دقیقه در طبقه وسط فر میگذاریم البته فر را باید از قبل در دمای 180 درجه گرم کنید!\n" +
                        "        در صورتیکه میخواهید روی پیتزای شما طلایی شود گریل بالا را روشن کنید ومواظب باشد پنیر پیتزایتان نسوزد! پیتزایتان را باسس دلخواه سرو نمایید\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.kitchen, "کیچن استراگانوف", "مواد لازم مدرن", "طرز تهیه مدرن"));
        arrayFoods.add(new ItemRecycler(R.drawable.sokhari, "مرغ سوخاری", "مواد لازم مدرن", "طرز تهیه مدرن"));
        arrayFoods.add(new ItemRecycler(R.drawable.img3, "هات داگ", "مواد لازم مدرن", "طرز تهیه مدرن"));
        arrayFoods.add(new ItemRecycler(R.drawable.rejimiomlet,
                "املت کبابی رژیمی",
                "اسفناج به مقدار لازم\n" +
                        "گوجه فرنگی 4 عدد\n" +
                        "زعفران به مقدار لازم\n" +
                        "روغن زیتون به مقدار لازم\n" +
                        "نمک و فلفل به مقدار لازم\n" +
                        "تخم مرغ 4 عدد\n",
                "1-ابتدا مقدار كمی اسفناج را بخار پز كرده و به آن نمك و فلفل اضافه كنید.چند عدد گوجه فرنگی سفت و پهن را انتخاب كرده و سر آن را كمی بكنید و با قاشق داخل آن را خالی كنید طوری كه دیواره و كف گوجه فرنگی ۱تا۲سانت ضخامت داشته باشد.\n" +
                        "2-سینی فر را با كمی روغن زیتون چرب كنید.داخل هر گوجه فرنگی مقداری اسفناج پخته شده، نمك،زعفران،ادویه و سایر مواد دلخواه را اضافه كرده و یك عدد تخم مرغ داخل آن بشكنید.\n" +
                        "3-مواد داخل گوجه ها را كمی با روغن تفت دهید و داخل سینی فر بریزید و كمی رویش اسفناج ریخته و بعد گوجه ها را روی آن قرار دهید.\n" +
                        "4-سینی را درون فر قرار دهید و اجازه دهید با حرارت فر گوجه ها کبابی و نرم شوند و تخم مرغ ها بپزند ، پس از اماده شدن سینی را از فر خارج کنید و مقداری روغن زیتون روی تخم ها بریزید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.rejimipolosabzijat,
                "پلو سبزیجات با لوبیا قرمز",
                "روغن مايع سه قاشق غذاخوري\n" +
                        "برنج 250 گرم\n" +
                        "فلفل دلمه اي سبزو پیاز نگيني خرد شده هر کدام يك عدد\n" +
                        "پودر چيلي(فلفل قرمز تند) يك قاشق چايخوري\n" +
                        "ذرت پخته 150 گرم\n" +
                        "لوبيا قرمز پخته 225 گرم\n" +
                        "گشنيز تازه خرد شده دو قاشق غذاخوري\n" +
                        "زعفران آب كرده نمک و فلفل زردچوبه به ميزان لازم\n",
                "در تابه روغن را گرم سپس پيازها را اضافه كرده كمي كه سبك شد فلفل قرمز و زردچوبه را اضافه مي كنيم. بعد از آن فلفل دلمه را اضافه كرده و لوبيا قرمز را كه قبل پخته ايم را مي ريزيم و ذرت پخته را به آن مي افزاييم. برنج را درون آبي كه از قبل به جوش آورده ايم همراه با نمك ريخته و كمي زنده تر آبكش مي كنيم سپس درون قابلمه لايه لايه از برنج، مواد و گشنيز ريخته و در آخر زعفران آب كرده را مي ريزيم."));
        arrayFoods.add(new ItemRecycler(R.drawable.rejimikababgiahi,
                "کباب سبزیجات مخصوص",
                "کدو سبز 2 عدد\n" +
                        "پیاز 1 عدد\n" +
                        "قارچ دکمه ای 250 گرم\n" +
                        "فلفل دلمه ای 1 عدد\n" +
                        "روغن زیتون یا مایع 2 قاشق غذاخوری\n" +
                        "سیر 3 حبه\n" +
                        "پودر فلفل قرمز 1/4 قاشق چایخوری\n" +
                        "پودر گشنیز 1 قاشق چایخوری\n" +
                        "پودر زیره سبز 1/4 قاشق چایخوری\n" +
                        "آبلیمو 2 قاشق غذاخوری\n" +
                        "جعفری و گشنیز خرد شده از هر کدام 2 قاشق غذاخوری\n" +
                        "سرکه سفید و نمک مقدار لازم\n",
                "1- برای تهیه سس مخصوص کباب ابتدا روغن زیتون ، پودر زیره ، پودر گشنیز ، آبلیمو ، سیر و پودر فلفل قرمز را داخل میکسر بریزید ، نمک و چند قاشق سرکه اضافه کنید و بزنید تا سس یکدست شود.\n" +
                        "2- در انتها جعفری و گشنیز خرد شده را به سس اضافه کنید و کمی بزنید (نیازی به میکس کردن کامل جعفری و گشنیز نیست. بهتر است خرده های جعفری و گشنیز داخل سس مشخص باشد).\n" +
                        "3- کدو سبز را حلقه ای خرد کنید ، فلفل دلمه ای و پیاز را نیز درشت خرد کنید ؛ سبزیجات خرد شده را به همراه قارچ داخل کیسه فریزر بریزید و سس را اضافه کنید ، با تکان دادن سبزیجات را به سس اغشته کنید ، در کیسه را ببندید و حداقل به مدت 4 ساعت داخل یخچال قرار دهید تا سبزیجات مزه دار شوند.\n" +
                        "4- سیخ های چوبی را 30 دقیقه در اب خیس دهید ، سبزیجات را به سیخ های چوبی بکشید سپس داخل سینی فر که چرب کرده اید قرار دهید ، گریل بالا را روشن کنید و هر چند دقیقه بچرخانید تا سبزیجات کبابی و نرم شوند سپس سرو کنید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.rejimiesmoti, "اسموتی کیوی با نعناع", "مواد لازم رژیمی", "طرز تهیه رژیمی"));
        arrayFoods.add(new ItemRecycler(R.drawable.rejimisalad, "سالاد سیب زمینی رژیمی", "مواد لازم رژیمی", "طرز تهیه رژیمی"));
        arrayFoods.add(new ItemRecycler(R.drawable.rejimikeik, "کیک شکلاتی فوری (کم کالری)", "مواد لازم رژیمی", "طرز تهیه رژیمی"));
        arrayFoods.add(new ItemRecycler(R.drawable.danesgzorat,
                "ذرت مکزیکی",
                "ذرت شیرین 500 گرم\n" +
                        "نمک و فلفل به میزان لازم\n" +
                        "قارچ 250 گرم\n" +
                        "پنیر پیتزا 100 گرم\n" +
                        "آویشن 1 ق چ\n" +
                        "کره 30 گرم\n" +
                        "روغن مایع 3 تا 4 ق س\n" +
                        "سس مایونز 1 و نیم پیمانه\n" +
                        "نمک 1 ق چ\n" +
                        "فلفل سیاه نصف ق چ\n" +
                        "فلفل قرمز 1/2 ق چ\n" +
                        "پودر گلپر 1 ق چ\n" +
                        "ادویه کاری 1/2 ق چ\n",
                "رای درست کردن ذرت مکزیکی میتوانید از ذرت های شیرین تازه و یا از کنسرو ذرت استفاده کنید.قارچ ها را هم خرد میکنیم و در یک قابلمه ای که 2/3 آن را پر از آب کردیم و مقداری آبلیمو ریختیم و روی حرارت به جوش آمد میریزیم و فقط در حدی که یک جوش بخورد داخل قابلمه نگه میداریم و سریع داخل آبکش میریزیم و زیر آب سرد نگه میداریم .\n" +
                        "بعد از این مراحل، کره و روغن مایع را داخل قابلمه ای میریزیم تا داغ شود و بعد ذرت را داخل کره و روغن کمی تفت میدهیم در حدی که طعم دار شوند. بعد قارچ ها ی بلانچ شده را داخل آن میریزیم و در حد هم زدن و مخلوط کردن تفت میدهیم .\n" +
                        "نمک ، فلفل ، و بقیه ادویه ها را هم اضافه میکنیم و هم میزنیم تا مواد روی حرارت گرم شوند .\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.daneshmakaroni,
                "ماکارونی",
                "ماکارونی:1 بسته\n" +
                        "فلفل دلمه:1عدد\n" +
                        "نخود فرنگی:100 گرم\n" +
                        "پیازمتوسط:2عدد\n" +
                        "رب:2 قاشق غذا خوری\n" +
                        "قارچ:200گرم\n" +
                        "گوشت چرخ کرده:300 گرم\n" +
                        "نمک و ادویه کاری:به مقدار لازم\n",
                "تابه ای را روی حرارت قرار دهید و مقداری روغن داخلش بریزید تا داغ شود. بعد پیاز را داخل روغن تفت دهید تا طلایی شود.  سپس گوشت را به پیاز سرخ شده اضافه کنید و تفت دهید  تا گوشت کمی سرخ شود و رنگش تغییر کند.\n" +
                        "بعد از تفت گوشت فلفل دلمه و قارچ خرد شده را هم به آن اضافه کنید و تفت دهید تا نرم شوند. در آخر رب گوجه را به مواد تفت داده شده اضافه کنید و کمی تفت دهید تا رنگ رب باز شود.\n" +
                        "و به همراه یک استکان آب جوش بگذارید تا گوشت بپزد و آب آن  کاملا جذب شود. در مرحله بعد ماکارونی را طبق دستور بپزید و آبکش کنید .\n" +
                        " ته قابلمه مورد نظر تان را چرب کنید و کف آن ته دیگ سیب زمینی بچینید و مقداری از ماکارونی را روی آن بریزید و روی ماکارونی مقداری آز مواد گوشت تفت داده شده بریزید و این لایه را آنقدر تکرار کنید تا تمام شوند.\n" +
                        "البته میتوانید ماکارونی و مایه گوشت را قبل ریختن در قابلمه با هم مخلوط کنید و یکجا در قابلمه بریزید و دم دهید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.daneshestamboli,
                "استانبولی پلو",
                "گوشت مغز ران بدون استخوان :750گرم\n" +
                        "برنج :یک کیلو\n" +
                        "رب گوجه فرنگی :یک قاشق سوپخوری\n" +
                        "گوجه فرنگی:سه کیلو\n" +
                        "پیاز سرخ کرده  :3 تا 4 قاشق سوپخوری\n" +
                        "روغن :100 تا 150گرم\n" +
                        "نمک و فلفل :به مقدار کافی\n",
                "ابتدا برنج را تمیز کنید و با آب ولرم بشویید . بعد گوجه فرنگی ها را بشویید و آب آن را بگیرد و به همراه آب معمولی پیمانه کنید و روی برنج بریزید ، به حدی که 4 انگشت از سطح برنج بالاتر به ایستد. \n" +
                        "به اندازه کافی نمک به آن اضافه کنید و آب آن را بچشید تا خیلی شور نشود. چون برنج به صورت کته درست میشود باید در میزان ریختن نمک دقت کنید و کم کم نمک را بریزید تا به مزه دلخواه برسید.\n" +
                        "بعد 3 تا 4 قاشق روغن هم داخل آب برنج بریزد و بگذارید تا برنج یکی دو ساعت خیس بخورد. گوشت را به صورت خیلی ریز خرد کنید ( به صورت قیمه ای ) و به همراه پیاز سرخ کرده تفت دهید تا آب گوشت کشیده شود.\n" +
                        "بعد 2 تا 3 لیوان آب داخل گوشت تفت داده شده بریزید تا گوشت با حرارت کم بپزد.در حین پخت ، به آن رب و کمی نمک هم اضافه کنید .\n" +
                        "بعد از اینکه گوشت کاملا پخته شد و آب آن تبخیر شد . برنج را روی حرارت قرار دهید تا به جوش بیاید و آب آن تبخیر شود.\n" +
                        "اگر حس کردید آب برنج کم است و مغز برنج کمی خام است به آن یکی دو پیمانه آب یا آب گوجه فرنگی اضافه کنید.\n" +
                        "بعد از تبخیر کامل آب برنج ، وسط آن را باز کنید و گوشت قیمه را وسط آن قرار دهید و بعد با برنج روی آن را بپوشانید .\n" +
                        "در قابلمه را محکم ببندید و روی حرارت کم قرار دهید تا برنج دم بکشد.این برنج را میتوانید در فر هم به مدت نیم ساعت با حرارت 350 درجه و یا یکساعت با حرارت 300 در جه هم دم کنید.\n" +
                        "استامبولی را میتوانید با گوشت چرخ کرده و یا رب گوجه فرنگی هم تهیه کنید. که در اینصورت باید حدود یک لیوان از رب مرغوب استفاده کنید.\n" +
                        "برای پیمانه کردن برنج هم بهتر است به ازای هر پیمانه برنج یک و نیم تا 2 پیمانه آب در نظر بگیرید.\n" +
                        "اگر هم از گوشت چرخ کرده استفاده کردید ، بهتر است گوشت را با پیاز سرخ کنید و یک قاشق رب را در یک لیوان آب مخلوط کنید و داخل گوشت بریزید تا به آرامی گوشت بپزد و آبش کشیده شود.\n" +
                        "استامبولی پلو با آب گوجه فرنگی تازه و گوشت قیمه ای خیلی بهتر میشود.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.daneshomlet, "املت", "مواد لازم دانشجویی", "طرز تهیه دانشجوی"));
        arrayFoods.add(new ItemRecycler(R.drawable.daneshkoko, "کوکو تن ماهی با سیب زمینی", "مواد لازم دانشجویی", "طرز تهیه دانشجوی"));
        arrayFoods.add(new ItemRecycler(R.drawable.daneshdampokhtak, "دمی گوجه", "مواد لازم دانشجویی", "طرز تهیه دانشجوی"));
        arrayFoods.add(new ItemRecycler(R.drawable.tanaqolatlavashak,
                "لواشک انار و به",
                "به     1 عدد بزرگ\n" +
                        "دانه انار یا آب انار   2 لیوان\n" +
                        " آبلیمو3 قاشق غذاخوری\n",
                "به را خوب بشوید و به قطعات کوچک تر خرد کنید و تخم آن را جدا کنید.دانه های انار را هم داخل میکسر بریزید تا عصاره آن خارج شود.حتی میتوانید از آب انار هم استفاده کنید که راحت تر است.\n" +
                        "سپس به ریز شده را به همراه آب انار و 3 قاشق آب لیمو داخل قابلمه ای بریزید و قابلمه را روی حرارت ملایم قرار دهید تا به جوش بیاید. بعد از اینکه به جوش آمدند اجازه دهید تا با حرارت کم مواد لواشک به مدت نیم ساعت آرام آرام بجوشند.اگر حس کردید لواشک خیلی ترش میشود میتوانید در این مرحله 1 قاشق شکر هم به آن اضافه کنید تا به همراه بقیه مواد بجوشد.\n" +
                        "پس از سپری شدن این زمان مواد را از روی حرارت بردارید و بگذارید تا کمی خنک شود.سپس داخل میکسر بریزید تا به شکل پوره شوند.\n" +
                        "داخل سینی فر یک کاغذ روغنی بیندازید و موااد پوره شده را به صورت نازک روی کاغذ پخش کنید .\n" +
                        "سینی را داخل فر به مدت 1 تا 2 ساعت  با دمای 120 درجه سانتی گراد  قرار دهید تا لواشک خودش را بگیرد.\n" +
                        "سینی را از فر خارج کنید تا لواشک سرد شود و بتوانید مصرف کنید.\n" +
                        "لواشک های آماده شده را به اندازه های دلخواه ببرید و در کیسه فریزر نگهداری کنید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.tanaqolatzhele,
                "ژله آب نبات چوبی",
                "۱ بسته ژله قرمز طعم دلخواه\n" +
                        "۱ بسته ژله ابی طعم دلخواه\n" +
                        "ژله سفید( ژله شیر عسلی یا بستنی)\n" +
                        "رنگ و طعم ژله ها به دلخواه خودتان قابل تغییر است.\n",
                "ابتدا دو رنگ ژله( در اینجا سفید و قرمز) را اماده کنید ودر ظرف کم عمق مستطیل شکل بریزید و در یخچال بگذارید تا کاملا ببندد.بعد به مکعب های کوچک ببرید.\n" +
                        "مکعب ها رنگی را مخلوط کرده داخل قالب مستطیل شکل دیگری بریزید.\n" +
                        "ژله پایه را(در اینجا ابی) به رنگ دلخواه اماده کنید اجازه دهید تا خنک شود بعد روی خرده ژله ها در حدی بریزید که ۳/۴ سطح ژله ها را بپوشاند.بنابر این مقداری از ژله پایه شما اضافه می ماند و روی خرده ژله ها کامل پوشیده نمیشود.\n" +
                        "داخل یخچال قرار دهید تا کاملا بسته شود.\n" +
                        "از یخچال در اورده لبه های ژله را ازاد کرده و روی سطح نچسبی برگردانید.\n" +
                        "ژله را به شکل نبات به عرض حدود ۲ سانتی متر ببرید .لبه چاقو را جوری حرکت دهید که موقع برش لبه های ناصاف ایجاد کند تا شکل نبات ایجاد شود.از انتهای ژله ها نی نازک فرو کنید تا ۲/۳ ژله.\n" +
                        "اگر عرض برش کم باشد موقعی که نی میزنید شکسته خواهد شد.\n" +
                        "در ظرف مناسبی بچینید و سرو کنید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.tanaqolatmive,
                "میوه خشک",
                "میوه های کوچک مثل انگور، توت فرنگی، گیلاس و گوجه فرنگی مینیاتوری را می توان به صورت درسته خشک کرد. میوه های متوسط را می توان نصف یا حلقه حلقه کرد و میوه های بزرگ یا خیلی سفت مثل انبه، آناناس و نارگیل را باید ورقه ورقه کرد.",
                " اگر دوست دارید پوست میوه ها را بگیرید ، تکه های میوه را 30 ثانیه در آب جوش بریزید و سپس به یک ظرف آب یخ منتقل کنید تا پوست میوه ها راحت جدا شود.\n" +
                        " برای حفظ ظاهر زیبای میوه ها و به حداقل رسیدن تغییر رنگ شان آنها را 10 دقیقه درون آب لیمو و آب قرار دهید، سپس در آبکش بریزید و با یک حوله ی بدون پرز به آرامی خشک کنید.\n" +
                        " فر را از قبل در دمای 54 تا 71 درجه ی سانتی گراد گرم کنید.\n" +
                        " از درجه ی حرارت پایین تر برای میوه های برش خورده ی نازک مانند سیب یا هلو و از دمای بالاتر برای توت فرنگی ها و سایر توت های کامل استفاده کنید.\n" +
                        " روی سینی فر را با کاغذ مومی بپوشانید و تکه های میوه را با حفظ فاصله بچینید.\n" +
                        "یک توری گرد مخصوص پیتزا یا یک لاینر سیلیکونی روی میوه ها برای جلوگیری از جمع شدن (لوله شدن) آنها قرار دهید.\n" +
                        " میوه ها را درون فر بگذارید و هر دو ساعت سینی فر را بچرخانید.\n" +
                        " هنگامی که میوه خشک بافتی مانند چرم پیدا کرد و حدی منعطف بود، آماده بیرون آوردن از فر است.\n" +
                        " بعد از بیرون آوردن میوه های خشک از فر آنها را در ظرف های پلاستیکی یا شیشه ای بریزید و برای 4 تا 5 روز سر ظرفها را باز بگذارید تا رطوبت باقی مانده آنها تبخیر شود. در طی این روزها ظرف را ، تکان دهید تا میوه ها کمی جابه جا شوند.پس از 5 روز، در ظرف را ببندید\n" +
                        " حدود 10 ماه بعداز این میوه های خشک می توانید استفاده کنید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.tanaqolatalu, "آلوی شکلاتی", "مواد لازم تنقلات", "طرز تهیه تنقلات"));
        arrayFoods.add(new ItemRecycler(R.drawable.tanaqolatqand, "قندهای رنگی", "مواد لازم تنقلات", "طرز تهیه تنقلات"));
        arrayFoods.add(new ItemRecycler(R.drawable.tanaqolatmoz, "موز یخ زده با روکش شکلات", "مواد لازم تنقلات", "طرز تهیه تنقلات"));
        arrayFoods.add(new ItemRecycler(R.drawable.kabab, "برای کباب کوبیده زعفرانی",
                "گوشت چرخ کرده :یک کیلو\n" +
                        "پیاز متوسط :4 عدد\n" +
                        "نمک و فلفل:به مقدار لازم\n" +
                        "زعفران :به مقدار لازم",
                "در تهیه این کباب، از گوشت چرخ کرده ای که 30 در صد چربی داشته باشد استفاده کنید. گوشت را در یک ظرف مسی بریزید و پیاز را داخل آن رنده کنید.\n" +
                        "نمک، فلفل و زعفران را اضافه کنید و تا جایی که می توانید، گوشت را ورز دهید تا حدی که گوشت، حالت چسبندگی پیدا کند. می توان برای ایجاد چسبدگی بیشتر، از زرده یک تخم مرغ استفاده کرد.\n" +
                        "برای سیخ کردن کباب هم باید توجه داشته باشید که از سیخ های پهن برای پخت این کباب باید استفاده کنید.\n" +
                        "قبل از اینکه شروع به کار کنید، مقدماتی لازم است. ابتدا در کاسه کوچکی مقداری آب سرد بریزید و کنار دست تان قرار دهید. حالا پیش از برداشتن مایه کباب دست تان را در آب خیس کرده، یک مشت از مایه را بردارید و به شکل دوک درآورید؛ سپس همان طور که مواد در دست راست تان قرار دارد، سیخ را روی مایه دوکی بگذارید و شروع به پوشاندن سطح سیخ با مایه کباب کنید.\n" +
                        "در پایان دوباره دست تان را در آب سرد فرو کنید و روی سیخ فشار دهید تا اثر انگشتان شما بر گوشت باقی بماند. حالا ابتدا و انتهای کباب را به سیخ بچسبانید و کناری بگذارید. همین کار را درباره همه مواد و سیخ ها انجام دهید."));
        arrayFoods.add(new ItemRecycler(R.drawable.pitzza1,
                "پیتزا پپرونی",
                "گوشت چرخ کرده:200گرم\n" +
                        "فلفل دلمه ای:1عدد\n" +
                        "رب گوجه فرنگی :3قاشق غذاخوری\n" +
                        "قارچ :200گرم\n" +
                        "پیاز :1عدد\n" +
                        "کالباس : 200گرم\n" +
                        "پنیرپیتزا :به مقدازلازم\n" +
                        "نمک فلفل پودر اویشن:به مقذار دلخواه\n",
                "  پیاز راخرد کنید ودرون ماهیتابه بامقداری روغن تفت بدهید تانرم شود سپس گوشت نمک فلفل وپودر اویشن رابه ان اضافه کرده وباحرارت ملایم تفت میدهیم!پس از اینکه رنگ گوشت تغییر کرد 1قاشق رب گوجه فرنگی اضافه نموده ودوباره تفت میدهیم وپس از 5دقیقه از روی حرارت اجاق برمیداریم!\n" +
                        "        کالباس رامکعبی خرد کنید پیاز راحلقه ای خرد کنید فلفل دلمه ای را ریز کرده مقداری زیتون هم ریز کنید!\n" +
                        "        خمیر پیتزا را نازک پهن کنید 2قاشق رب گوجه فرنگی راتفت داده تا بوی خامی ندهد سپس با قلمو روی خمیر پیتزا پخش کنید ومقداری پنیر بریزید وتمامی موادی راکه خرد کرده بودید(کالباس پیاز و...)به همراه مایه گوشتی روی خمیر بچینید ودر انتها با لایه کاملی از پنیر پیتزا پوشش دهیدوروی ان زیتون بریزیدو اجازه دهید پیتزای شما 20دقیقه بماند تا خمیر استراحت کند ودر زمان پخت خوب ترد وبرشته شود.\n" +
                        "        پیتزا را به مدت 15الی 20 دقیقه در طبقه وسط فر میگذاریم البته فر را باید از قبل در دمای 180 درجه گرم کنید!\n" +
                        "        در صورتیکه میخواهید روی پیتزای شما طلایی شود گریل بالا را روشن کنید ومواظب باشد پنیر پیتزایتان نسوزد! پیتزایتان را باسس دلخواه سرو نمایید\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.soupjo,
                "سوپ جو قرمز",
                "جو پرک :3/4 لیوان\n" +
                        "آب مرغ :   7 لیوان\n" +
                        "پیاز :1 عدد متوسط\n" +
                        "هویج :2 عدد متوسط\n" +
                        "آبلیمو:2 قاشق غذا خوری\n" +
                        "رب گوجه :یک و نیم قاشق غذا خوری\n" +
                        "آرد :2 قاشق غذا خوری سر پر\n" +
                        "آب :1 لیوان\n" +
                        "جعفری خشک :1 قاشق غذا خوری سرپر\n" +
                        "ادویه کاری :نصف قاشق چایخوری\n" +
                        "نمک و فلفل سیاه :به مقدار کافی\n",
                "ابتدا اسکلت مرغ و هویج وزعفران و سیر وپیاز ونمک و برگ بو را با حدود دو و نیم لیتر آب می گذاریم تا بپزه و سپس آنرا صاف می کنیم .. آب مرغ را هم می تونیم در فریزر نگهداری کنیم و برای درست کردن سوپ از آن استفاده کنیم ..\n" +
                        "پیاز وهویج را خیلی ریز خرد می کنیم.\n" +
                        "مواد فوق را به همراه آب مرغ و جوپرک را روی حرارت می گذاریم تا به جوش بیاد و سپس حرارت را ملایم می کنیم ودر قابلمه را می گذاریم تا حدود نیم ساعت بپزه.\n" +
                        "سپس آرد را دریک لیوان آب سرد حل می کنیم و به همراه ادویه وجعفری به سوپ اضافه می کنیم و صبر می کنیم تا دوباره به جوش بیاد و بوی خامی ارد بره.\n" +
                        "در آخر آبلیمو ورب گوجه را به سوپ اضافه می کنیم. و صبر می کنیم تا سوپ جا بیفته …\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.rejimipolosabzijat,
                "پلو سبزیجات با لوبیا قرمز",
                "روغن مايع سه قاشق غذاخوري\n" +
                        "برنج 250 گرم\n" +
                        "فلفل دلمه اي سبزو پیاز نگيني خرد شده هر کدام يك عدد\n" +
                        "پودر چيلي(فلفل قرمز تند) يك قاشق چايخوري\n" +
                        "ذرت پخته 150 گرم\n" +
                        "لوبيا قرمز پخته 225 گرم\n" +
                        "گشنيز تازه خرد شده دو قاشق غذاخوري\n" +
                        "زعفران آب كرده نمک و فلفل زردچوبه به ميزان لازم\n",
                "در تابه روغن را گرم سپس پيازها را اضافه كرده كمي كه سبك شد فلفل قرمز و زردچوبه را اضافه مي كنيم. بعد از آن فلفل دلمه را اضافه كرده و لوبيا قرمز را كه قبل پخته ايم را مي ريزيم و ذرت پخته را به آن مي افزاييم. برنج را درون آبي كه از قبل به جوش آورده ايم همراه با نمك ريخته و كمي زنده تر آبكش مي كنيم سپس درون قابلمه لايه لايه از برنج، مواد و گشنيز ريخته و در آخر زعفران آب كرده را مي ريزيم."));
        arrayFoods.add(new ItemRecycler(R.drawable.danesgzorat,
                "ذرت مکزیکی",
                "ذرت شیرین 500 گرم\n" +
                        "نمک و فلفل به میزان لازم\n" +
                        "قارچ 250 گرم\n" +
                        "پنیر پیتزا 100 گرم\n" +
                        "آویشن 1 ق چ\n" +
                        "کره 30 گرم\n" +
                        "روغن مایع 3 تا 4 ق س\n" +
                        "سس مایونز 1 و نیم پیمانه\n" +
                        "نمک 1 ق چ\n" +
                        "فلفل سیاه نصف ق چ\n" +
                        "فلفل قرمز 1/2 ق چ\n" +
                        "پودر گلپر 1 ق چ\n" +
                        "ادویه کاری 1/2 ق چ\n",
                "رای درست کردن ذرت مکزیکی میتوانید از ذرت های شیرین تازه و یا از کنسرو ذرت استفاده کنید.قارچ ها را هم خرد میکنیم و در یک قابلمه ای که 2/3 آن را پر از آب کردیم و مقداری آبلیمو ریختیم و روی حرارت به جوش آمد میریزیم و فقط در حدی که یک جوش بخورد داخل قابلمه نگه میداریم و سریع داخل آبکش میریزیم و زیر آب سرد نگه میداریم .\n" +
                        "بعد از این مراحل، کره و روغن مایع را داخل قابلمه ای میریزیم تا داغ شود و بعد ذرت را داخل کره و روغن کمی تفت میدهیم در حدی که طعم دار شوند. بعد قارچ ها ی بلانچ شده را داخل آن میریزیم و در حد هم زدن و مخلوط کردن تفت میدهیم .\n" +
                        "نمک ، فلفل ، و بقیه ادویه ها را هم اضافه میکنیم و هم میزنیم تا مواد روی حرارت گرم شوند .\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.tanaqolatmive,
                "میوه خشک",
                "میوه های کوچک مثل انگور، توت فرنگی، گیلاس و گوجه فرنگی مینیاتوری را می توان به صورت درسته خشک کرد. میوه های متوسط را می توان نصف یا حلقه حلقه کرد و میوه های بزرگ یا خیلی سفت مثل انبه، آناناس و نارگیل را باید ورقه ورقه کرد.",
                " اگر دوست دارید پوست میوه ها را بگیرید ، تکه های میوه را 30 ثانیه در آب جوش بریزید و سپس به یک ظرف آب یخ منتقل کنید تا پوست میوه ها راحت جدا شود.\n" +
                        " برای حفظ ظاهر زیبای میوه ها و به حداقل رسیدن تغییر رنگ شان آنها را 10 دقیقه درون آب لیمو و آب قرار دهید، سپس در آبکش بریزید و با یک حوله ی بدون پرز به آرامی خشک کنید.\n" +
                        " فر را از قبل در دمای 54 تا 71 درجه ی سانتی گراد گرم کنید.\n" +
                        " از درجه ی حرارت پایین تر برای میوه های برش خورده ی نازک مانند سیب یا هلو و از دمای بالاتر برای توت فرنگی ها و سایر توت های کامل استفاده کنید.\n" +
                        " روی سینی فر را با کاغذ مومی بپوشانید و تکه های میوه را با حفظ فاصله بچینید.\n" +
                        "یک توری گرد مخصوص پیتزا یا یک لاینر سیلیکونی روی میوه ها برای جلوگیری از جمع شدن (لوله شدن) آنها قرار دهید.\n" +
                        " میوه ها را درون فر بگذارید و هر دو ساعت سینی فر را بچرخانید.\n" +
                        " هنگامی که میوه خشک بافتی مانند چرم پیدا کرد و حدی منعطف بود، آماده بیرون آوردن از فر است.\n" +
                        " بعد از بیرون آوردن میوه های خشک از فر آنها را در ظرف های پلاستیکی یا شیشه ای بریزید و برای 4 تا 5 روز سر ظرفها را باز بگذارید تا رطوبت باقی مانده آنها تبخیر شود. در طی این روزها ظرف را ، تکان دهید تا میوه ها کمی جابه جا شوند.پس از 5 روز، در ظرف را ببندید\n" +
                        " حدود 10 ماه بعداز این میوه های خشک می توانید استفاده کنید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.myan1, "شکلات دانه ای غنی از پروتئین",
                "۱۲ خرمای مجول\n" +
                        "۴/۱ فنجان دانه شاهدانه\n" +
                        "۴/۱ فنجان دانه چیا\n" +
                        "۴/۱ فنجان دانه کنجد\n" +
                        "۴/۱ فنجان پودر کاکائو\n" +
                        "½ عصاره وانیل\n" +
                        "۴/۱ قاشق چای خوری دارچین\n" +
                        "۴/۱ قاشق نمک دریا به منظور طعم دهی\n" +
                        "۴/۱ فنجان کاکائو\n",
                "۱٫ خرما را در آسیاب قرار دهید و تا زمان خمیر مانند شدن ادامه دهید.\n" +
                        "۲٫ شاهدانه، چیا، کنجد، کاکائو، وانیل، دارچین و نمک را بی افزایید. تا زمان ترکیب کامل هم بزنید. کاکائو را نیز ترکیب کنید. خمیر باید چسبنده باشد (درصورتی که چسبنده نباشد، یک یا دو قاشق چای خوری آب بی افزایید).\n" +
                        "۳٫ آن ها را به صورت توپ های کوچک درآورده و به مدت ۲۰ دقیقه در فریزر قرار دهید. باقیمانده را در فریزر نگهداری نمایید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.myan2, "ترکیبی از آجیل و میوه جات خشک شده خانگی",
                "½ فنجان کران بری خشک شده\n" +
                        "½ فنجان بادام رنده شده\n" +
                        "½ فنجان دانه کدوتنبل\n" +
                        "½ فنجان گردو\n" +
                        "½ فنجان کشمش\n",
                "تمام موارد را ترکیب کرده و به ۶ قسمت تقسیم نمایید.\n" +
                        "\nتهیه این نوع از اسنک های سریع نیز بسیار آسان می باشد. شما می توانید این ترکیب را در بسیار از فروشگاه ها مشاهده کنید بنابراین دیگر بهانه ای برای استفاده از میان وعده های ناسالم وجود ندارد. اما من ترجیح می دهم که خودم آن را ترکیب کنم زیرا در این صورت تمام موارد موردعلاقه را ترکیب می کنم و نگران افزودنی های غیرمجاز نیستم.\n" +
                        "ازآنجایی که آجیل، دانه ها، نارگیل و توت های خشک شده همگی گزینه های بسیار عالی هستند بنابراین از موادی نظیر چوب شور و غلات یا حبوبات فراوری شده پرهیز نمایید.\n" +
                        "نوع موردعلاقه من ترکیب کرانبری و کدوتنبل می\u200Cباشد. دستورالعمل اصلی بیان دارد که ½ پیمانه از هرکدام را ترکیب کرده و در ۴ وعده مصرف نماییم اما این مقدار دارای کالری بسیار بالایی می باشد. بنابراین من آن را در ۶ وعده استفاده می کنم و درنتیجه ۶ گرم پروتئین و ۱۶۳ کالری انرژی را برای بدن خود فراهم می آورم و یک بار تهیه کردن نیز تا آخر هفته کافی می باشد.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.myan3, "لقمه بوقلمون، آووکادو و حمص",
                "یک یا دوتکه گوشت بوقلمون\n" +
                        "۲ ورقه آووکادو\n" +
                        "یک قاشق حمص\n",
                "گوشت بوقلمون را پهن کنید. اگر از دو ورقه استفاده می کنید آنها را روی هم بگذارید.\n" +
                        "حمص را بر روی گوشت قرار دهید. آووکادو را افزوده و آن را به حالت لقمه دربیاورید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.myan4, "اسموتی سبز غنی از پروتئین",
                "یک فنجان شیر نارگیل بدون شکر\n" +
                        "۲ فنجان اسفناج تازه\n" +
                        "یک موز یخ زده\n" +
                        "۲ قاشق روغن بادام\n" +
                        "۲ قاشق چای خوری عصاره وانیل\n" +
                        "۴/۱ فنجان (۱ پیمانه) پودر پروتئین وی\n" +
                        "یک فنجان یخ\n",
                "تمام مواد را ترکیب کرده و تا زمان رقیق شدن هم بزنید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.myan5, "نخود سرخ کرده",
                "۱ قاشق چای خوری روغن زیتون\n" +
                        "۱٫۵ قاشق چای خوری پودر فلفل\n" +
                        "۱٫۵ قاشق چای خوری زیره\n" +
                        "۴/۱ قاشق چای خوری نمک\n" +
                        "۸/۱ قاشق چای خوری فلفل کاین\n" +
                        "۲ قوطی نخود\n",
                "۱٫ فر را در دمای ۴۰۰ فارنهایت قرار دهید. تمام مواد را در یک کاسه بزرگ مخلوط کنید.\n" +
                        "۲٫ نخودها را در ماهی تابه قرار داده و در حدود ۳۵ تا ۴۰ دقیقه بپزید. آن را گرم سرو کنید.\n"));
        arrayFoods.add(new ItemRecycler(R.drawable.myan6,
                "دسر ماست یونانی",
                "۶ اونس ماست یونانی\n" +
                        "۳/۱ فنجان جوی بدون گلوتن، به صورت خام\n" +
                        "۱ قاشق چای خوری دانه چیا\n" +
                        "۲ قاشق شیر دلخواه (من شیر بادام را ترجیح می دهم)\n" +
                        "۱ فنجان میوه و توت \n",
                "۱٫ ماست، جو، دانه چیا، و شیر را در یک کاسه ترکیب کنید. آن را در یک ظرف شیشه ای پهن کنید.\n" +
                        "۲٫ نیمی از میوه ها و توت ها را بر روی آن ریخته و سپس باقی مخلوط را بر روی آن بریزید.\n" +
                        "۳٫ شب آن را در یخچال قرار داده و یا بعد از تهیه مصرف نمایید.\n"));
   return arrayFoods;

    }
}
